[M_Ep17_KillJack MissionDefinition]
MissionDescription="You must find and kill Handsome Jack before he can awaken the Warrior -- partially to save Pandora, partially to save Lilith, and partially because Jack is a real bastard. Jack is holed up in [place]Hero's Pass[-place], where the Warrior is buried. You will need Claptrap to get you through the Hyperion defenses set up there."
TurnInDescription="You killed Jack, defeated the Warrior, and saved Pandora. <br><br>You.<br>Are.<br>A badass."

[M_Ep17_KillJack:DefeatTheWarriorSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You beat up Handsome Jack, but weren't quick enough to stop the awakening of the Warrior. Oh, well -- better kick its ass, too."

[M_Ep17_KillJack:GoOnAloneSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You must find and kill Handsome Jack before he can awaken the Warrior -- partially to save Pandora, partially to save Lilith, and partially because Jack is a huge bastard. Claptrap got you into [place]Hero's Pass[-place], but, due to stairs-related complications, he will be unable to accompany his minion for the final leg of the journey. Do him proud."

[M_Ep17_KillJack:KillJackSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="It may have been too late to stop him from awakening the Warrior, but you've finally reached Handsome Jack. Now kill the bastard."

[M_Ep17_KillJack:LetLilithKillJack MissionObjectiveDefinition]
ProgressMessage="Let Lilith kill Jack"
